---
type: DGNExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DGNExportOptions

`Autodesk.Revit.DB.DGNExportOptions` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DGNExportOptions | — | `` |
| Constructor | DGNExportOptions | — | `public DGNExportOptions ()` |
| Method | GetExportLineweightTable | 2014 | `public ExportLineweightTable GetExportLineweightTable ()` |
| Method | GetPredefinedOptions | 2013 | `public static DGNExportOptions GetPredefinedOptions ( Document document , string setup )` |
| Method | GetPredefinedSetupNames | — | `public static IList < string > GetPredefinedSetupNames ( Document document )` |
| Method | SetExportLineweightTable | 2014 | `public void SetExportLineweightTable ( ExportLineweightTable lineweightTable )` |
| Property | FileVersion | 2013 | `public DGNFileFormat FileVersion { get ; set ; }` |
| Property | MergedViews | — | `public bool MergedViews { get ; set ; }` |
| Property | SeedName | 2013 | `public string SeedName { get ; set ; }` |
| Property | WorkingUnits | 2021.1 | `public bool WorkingUnits { get ; set ; }` |